#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.database_password: Refreshing state... [id=none]
random_password.staging_db_password: Refreshing state... [id=none]
google_cloud_run_domain_mapping.staging: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/domainmappings/staging.api.venturecapitol.de]
google_project_service.run: Refreshing state... [id=venture-capitol/run.googleapis.com]
google_project_service.places: Refreshing state... [id=venture-capitol/places-backend.googleapis.com]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/vc-backend]
google_storage_bucket.frontend_staging: Refreshing state... [id=vc-frontend-staging]
google_project_service.secretmanager: Refreshing state... [id=venture-capitol/secretmanager.googleapis.com]
google_cloud_run_domain_mapping.root: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/domainmappings/api.venturecapitol.de]
google_project_service.maps: Refreshing state... [id=venture-capitol/maps-backend.googleapis.com]
google_project_service.sql: Refreshing state... [id=venture-capitol/sqladmin.googleapis.com]
google_project_service.iam: Refreshing state... [id=venture-capitol/iam.googleapis.com]
google_storage_default_object_access_control.public_access: Refreshing state... [id=vc-frontend-staging/allUsers]
google_secret_manager_secret.db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string]
google_secret_manager_secret.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string]
google_service_account.backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/backend-sa@venture-capitol.iam.gserviceaccount.com]
google_sql_database_instance.vc_db: Refreshing state... [id=vc-backend-database]
google_secret_manager_secret_iam_binding.db_connection_string_access: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string/roles/secretmanager.secretAccessor]
google_project_iam_binding.service_permissions["run.admin"]: Refreshing state... [id=venture-capitol/roles/run.admin]
google_project_iam_binding.service_permissions["cloudsql.client"]: Refreshing state... [id=venture-capitol/roles/cloudsql.client]
google_secret_manager_secret_iam_binding.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string/roles/secretmanager.secretAccessor]
google_secret_manager_secret_version.db_connection_string_data: Refreshing state... [id=projects/122736358705/secrets/db_connection_string/versions/1]
google_sql_database.backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/backend]
google_secret_manager_secret_version.staging_db_connection_string: Refreshing state... [id=projects/122736358705/secrets/staging_db_connection_string/versions/1]
google_sql_user.staging_database_user: Refreshing state... [id=staging_backend_user//vc-backend-database]
google_sql_user.database_user: Refreshing state... [id=backend_user//vc-backend-database]
google_sql_database.staging_backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/staging_backend]
google_cloud_run_service.staging_backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.root will be destroyed
  # (because google_cloud_run_domain_mapping.root is not in configuration)
  - resource "google_cloud_run_domain_mapping" "root" {
      - id       = "locations/europe-west1/namespaces/venture-capitol/domainmappings/api.venturecapitol.de" -> null
      - location = "europe-west1" -> null
      - name     = "api.venturecapitol.de" -> null
      - project  = "venture-capitol" -> null
      - status   = [
          - {
              - conditions          = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "DomainRoutable"
                    },
                ]
              - mapped_route_name   = "vc-backend"
              - observed_generation = 1
              - resource_records    = [
                  - {
                      - name   = "api"
                      - rrdata = "ghs.googlehosted.com."
                      - type   = "CNAME"
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "serving.knative.dev/creator"      = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
              - "run.googleapis.com/overrideAt" = "2021-12-14T09:51:28.818Z"
            } -> null
          - namespace        = "venture-capitol" -> null
          - resource_version = "AAXTGEr9dWM" -> null
          - self_link        = "/apis/domains.cloudrun.com/v1/namespaces/122736358705/domainmappings/api.venturecapitol.de" -> null
          - uid              = "80081fb7-4818-4363-9c62-3928de573a8f" -> null
        }

      - spec {
          - certificate_mode = "AUTOMATIC" -> null
          - force_override   = false -> null
          - route_name       = "vc-backend" -> null
        }
    }

  # google_cloud_run_domain_mapping.staging will be destroyed
  # (because google_cloud_run_domain_mapping.staging is not in configuration)
  - resource "google_cloud_run_domain_mapping" "staging" {
      - id       = "locations/europe-west1/namespaces/venture-capitol/domainmappings/staging.api.venturecapitol.de" -> null
      - location = "europe-west1" -> null
      - name     = "staging.api.venturecapitol.de" -> null
      - project  = "venture-capitol" -> null
      - status   = [
          - {
              - conditions          = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "DomainRoutable"
                    },
                ]
              - mapped_route_name   = "vc-backend-staging"
              - observed_generation = 1
              - resource_records    = [
                  - {
                      - name   = "staging.api"
                      - rrdata = "ghs.googlehosted.com."
                      - type   = "CNAME"
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "serving.knative.dev/creator"      = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
              - "run.googleapis.com/overrideAt" = "2021-12-14T09:51:28.818Z"
            } -> null
          - namespace        = "venture-capitol" -> null
          - resource_version = "AAXTGEd1ucU" -> null
          - self_link        = "/apis/domains.cloudrun.com/v1/namespaces/122736358705/domainmappings/staging.api.venturecapitol.de" -> null
          - uid              = "fd6461d0-86b5-41d4-afd8-06362fe76b30" -> null
        }

      - spec {
          - certificate_mode = "AUTOMATIC" -> null
          - force_override   = false -> null
          - route_name       = "vc-backend-staging" -> null
        }
    }

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:55f906" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:49d6b5"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.dlr_backend will be created
  + resource "google_cloud_run_service" "dlr_backend" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "dlr-backend"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"      = "10"
                  + "run.googleapis.com/client-name"        = "dlr-backend"
                  + "run.googleapis.com/cloudsql-instances" = "venture-capitol:europe-west1:vc-backend-database"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/hello"

                  + env {
                      + name = "DATABASE_URL"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "dlr_db_connection_string"
                            }
                        }
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # google_cloud_run_service.dlr_staging_backend will be created
  + resource "google_cloud_run_service" "dlr_staging_backend" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "dlr-backend-staging"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"      = "10"
                  + "run.googleapis.com/client-name"        = "dlr-backend"
                  + "run.googleapis.com/cloudsql-instances" = "venture-capitol:europe-west1:vc-backend-database"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/hello"

                  + env {
                      + name = "DATABASE_URL"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "dlr_staging_db_connection_string"
                            }
                        }
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # google_cloud_run_service.staging_backend will be updated in-place
  ~ resource "google_cloud_run_service" "staging_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging"
        name                       = "vc-backend-staging"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:1d7872" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:49d6b5"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service_iam_policy.dlr_noauth will be created
  + resource "google_cloud_run_service_iam_policy" "dlr_noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "dlr-backend"
    }

  # google_cloud_run_service_iam_policy.dlr_staging_noauth will be created
  + resource "google_cloud_run_service_iam_policy" "dlr_staging_noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "dlr-backend-staging"
    }

  # google_cloud_run_service_iam_policy.gpf_noauth will be created
  + resource "google_cloud_run_service_iam_policy" "gpf_noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "venture-capitol"
      + service     = "vc-backend"
    }

  # google_cloud_run_service_iam_policy.noauth will be destroyed
  # (because google_cloud_run_service_iam_policy.noauth is not in configuration)
  - resource "google_cloud_run_service_iam_policy" "noauth" {
      - etag        = "BwXSCgnbgJY=" -> null
      - id          = "v1/projects/venture-capitol/locations/europe-west1/services/vc-backend" -> null
      - location    = "europe-west1" -> null
      - policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "allUsers",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> null
      - project     = "venture-capitol" -> null
      - service     = "v1/projects/venture-capitol/locations/europe-west1/services/vc-backend" -> null
    }

  # google_project_iam_binding.service_permissions["cloudsql.client"] will be updated in-place
  ~ resource "google_project_iam_binding" "service_permissions" {
        id      = "venture-capitol/roles/cloudsql.client"
      ~ members = [
          - "serviceAccount:backend-sa@venture-capitol.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_binding.service_permissions["run.admin"] will be updated in-place
  ~ resource "google_project_iam_binding" "service_permissions" {
        id      = "venture-capitol/roles/run.admin"
      ~ members = [
          - "serviceAccount:backend-sa@venture-capitol.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # google_secret_manager_secret.dlr_db_connection_string will be created
  + resource "google_secret_manager_secret" "dlr_db_connection_string" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "dlr_db_connection_string"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret.dlr_staging_db_connection_string will be created
  + resource "google_secret_manager_secret" "dlr_staging_db_connection_string" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "dlr_staging_db_connection_string"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_iam_binding.dlr_db_connection_string_access will be created
  + resource "google_secret_manager_secret_iam_binding" "dlr_db_connection_string_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_iam_binding.dlr_staging_db_connection_string will be created
  + resource "google_secret_manager_secret_iam_binding" "dlr_staging_db_connection_string" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_version.dlr_db_connection_string_data will be created
  + resource "google_secret_manager_secret_version" "dlr_db_connection_string_data" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.dlr_staging_db_connection_string will be created
  + resource "google_secret_manager_secret_version" "dlr_staging_db_connection_string" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = "projects/122736358705/secrets/staging_db_connection_string"
      + secret_data  = (sensitive value)
    }

  # google_service_account.dlr_backend_sa will be created
  + resource "google_service_account" "dlr_backend_sa" {
      + account_id = "dlr-backend-sa"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # google_service_account.dlr_staging_backend_sa will be created
  + resource "google_service_account" "dlr_staging_backend_sa" {
      + account_id = "dlr-backend-staging-sa"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # google_sql_database.dlr_backend_database will be created
  + resource "google_sql_database" "dlr_backend_database" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "vc-backend-database"
      + name      = "dlrbackend"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_database.dlr_staging_backend_database will be created
  + resource "google_sql_database" "dlr_staging_backend_database" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "vc-backend-database"
      + name      = "dlrbackend"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_user.dlr_database_user will be created
  + resource "google_sql_user" "dlr_database_user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "vc-backend-database"
      + name     = "dlr_backend_user"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # google_sql_user.dlr_staging_database_user will be created
  + resource "google_sql_user" "dlr_staging_database_user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "vc-backend-database"
      + name     = "dlr_backend_user"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # random_password.dlr_database_password will be created
  + resource "random_password" "dlr_database_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.dlr_staging_db_password will be created
  + resource "random_password" "dlr_staging_db_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 19 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>